# Linux内核
进程管理, 内存管理, 设备管理

# 核心程序库
- android.app - 提供应用程序模型的访问，是所有 Android 应用程序的基石
- android.content - 方便应用程序之间，应用程序组件之间的内容访问，发布，消息传递
- android.database - 用于访问内容提供者发布的数据，包含 SQLite 数据库管理类
- android.opengl - OpenGL ES 3D 图片渲染 API 的 Java 接口
- android.os - 提供应用程序访问标注操作系统服务的能力，包括消息，系统服务和进程间通信
- android.text - 在设备显示上渲染和操作文本
- android.view - 应用程序用户界面的基础构建块
- android.widget - 丰富的预置用户界面组件集合，包括按钮，标签，列表，布局管理，单选按钮等
- android.webkit - 一系列类的集合，允许为应用程序提供内建的 Web 浏览能力

# 应用框架
- 活动管理者 - 控制应用程序生命周期和活动栈的所有方面
- 内容提供者 - 允许应用程序之间发布和分享数据
- 资源管理器 - 提供对非代码嵌入资源的访问，如字符串，颜色设置和用户界面布局
- 通知管理器 - 允许应用程序显示对话框或者通知给用户
- 视图系统 - 一个可扩展的视图集合，用于创建应用程序用户界面
